// Задача 24: Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
// 7 -> 28
// 4 -> 10
// 8 -> 36

Console.Clear();
int s = int.Parse()
Console.Write
int Count(int n) // 123
{
    int count = 0; 
    if (n < 0)
    n *=  (-1);
    while (n > 0)
    {
        count++;
        n/=10;
    }
    return count;
}